In [53]:
import pandas as pd
import numpy as np

In [5]:
l1=[67,264,765,89,34,56,22]
s=pd.Series(l1)
print(s)

0     67
1    264
2    765
3     89
4     34
5     56
6     22
dtype: int64

In [11]:
l=pd.date_range("05-01-2021","07-01-2021")
s=pd.Series(l)
print(s)

0    2021-05-01
1    2021-05-02
2    2021-05-03
3    2021-05-04
4    2021-05-05
        ...
57   2021-06-27
58   2021-06-28
59   2021-06-29
60   2021-06-30
61   2021-07-01
Length: 62, dtype: datetime64[ns]

In [16]:
d1={"Apple":[3,4,56,7],"Bat":[8,9,5,6],"Cat":[5,8,9,6],"Dog":[9,7,5,3]}
d=pd.DataFrame(d1)
print(d)

   Apple  Bat  Cat  Dog
0      3    8    5    9
1      4    9    8    7
2     56    5    9    5
3      7    6    6    3

In [18]:
l1=[[4,5,6,7,8],[5,98,4,2,5]]
d=pd.DataFrame(l1)
print(d)

   0   1  2  3  4
0  4   5  6  7  8
1  5  98  4  2  5

In [21]:
rcsv=pd.read_csv("data.csv")
df=pd.DataFrame(rcsv)
print(df)

        State            Capital
0      Kerala  Thiruvanathapuram
1  Maharastra             Mumbai
2   Tamilnadu            Chennai
3   Karnataka          Bengaluru
4         Goa             Panaji

In [33]:
l1=[[4,5,6,7,8],[5,98,4,2,5],[3,56,678,9,4]]
d=pd.DataFrame(l1)
print(d)
print()
print(d.sort_values(0))
print()
print(d.sort_values(1))
print()
print(d.sort_values(2))
print()
print(d.sort_values(3))
print()
print(d.sort_values(4))

   0   1    2  3  4
0  4   5    6  7  8
1  5  98    4  2  5
2  3  56  678  9  4

   0   1    2  3  4
2  3  56  678  9  4
0  4   5    6  7  8
1  5  98    4  2  5

   0   1    2  3  4
0  4   5    6  7  8
2  3  56  678  9  4
1  5  98    4  2  5

   0   1    2  3  4
1  5  98    4  2  5
0  4   5    6  7  8
2  3  56  678  9  4

   0   1    2  3  4
1  5  98    4  2  5
0  4   5    6  7  8
2  3  56  678  9  4

   0   1    2  3  4
2  3  56  678  9  4
1  5  98    4  2  5
0  4   5    6  7  8

In [39]:
d1={"Apple":[3,4,56,7],"Bat":[8,9,5,6],"Cat":[5,8,9,6],"Dog":[9,7,5,3]}
d=pd.DataFrame(d1,index=['a','b','c','d'])
print(d)
print()
d=d.reset_index()
print(d)

   Apple  Bat  Cat  Dog
a      3    8    5    9
b      4    9    8    7
c     56    5    9    5
d      7    6    6    3

  index  Apple  Bat  Cat  Dog
0     a      3    8    5    9
1     b      4    9    8    7
2     c     56    5    9    5
3     d      7    6    6    3

In [48]:
d1={"Apple":[3,4,56,7],"Bat":[8,9,5,6],"Cat":[5,8,9,6],"Dog":[9,7,5,3]}
d=pd.DataFrame(d1)
print(d[:2])

   Apple  Bat  Cat  Dog
0      3    8    5    9
1      4    9    8    7

In [68]:
d1={"Name":["Stephen","Ram","Robert","Sam"],"Occupation":["Developer","Analyst","Developer","Analyst"],"Salary":[50000,80000,45000,35000]}
d=pd.DataFrame(d1)
print(d.groupby("Occupation")["Salary"].mean())
d

Occupation
Analyst      57500
Developer    47500
Name: Salary, dtype: int64

      Name Occupation  Salary
0  Stephen  Developer   50000
1      Ram    Analyst   80000
2   Robert  Developer   45000
3      Sam    Analyst   35000

In [72]:
d["Salary"]=d['Salary'].replace([45000], np.NaN)
print(d)
d.fillna(0)

      Name Occupation   Salary
0  Stephen  Developer  50000.0
1      Ram    Analyst  80000.0
2   Robert  Developer      NaN
3      Sam    Analyst  35000.0

      Name Occupation   Salary
0  Stephen  Developer  50000.0
1      Ram    Analyst  80000.0
2   Robert  Developer      0.0
3      Sam    Analyst  35000.0

In [76]:
d={"cname":["IBM","Google","Microsoft"],
  "Profit":[-10000000,100000,120000]}
df=pd.DataFrame(d)
df["Profit"]=df["Profit"]>0
df

       cname  Profit
0        IBM   False
1     Google    True
2  Microsoft    True

In [77]:
mdict1={"eid":[101,102,103],"ename":["abu","abdu","stephen"],"Stepend":[100,200,300]}
mdict2={"eid":[101,102,103],"designation":["clerk","teacher","student"]}
df1=pd.DataFrame(mdict1)
df2=pd.DataFrame(mdict2)
pd.merge(df1,df2,how="inner")

   eid    ename  Stepend designation
0  101      abu      100       clerk
1  102     abdu      200     teacher
2  103  stephen      300     student

In [6]:
print(dir(pd))

['BooleanDtype', 'Categorical', 'CategoricalDtype', 'CategoricalIndex', 'DataFrame', 'DateOffset', 'DatetimeIndex', 'DatetimeTZDtype', 'ExcelFile', 'ExcelWriter', 'Flags', 'Float32Dtype', 'Float64Dtype', 'Float64Index', 'Grouper', 'HDFStore', 'Index', 'IndexSlice', 'Int16Dtype', 'Int32Dtype', 'Int64Dtype', 'Int64Index', 'Int8Dtype', 'Interval', 'IntervalDtype', 'IntervalIndex', 'MultiIndex', 'NA', 'NaT', 'NamedAgg', 'Period', 'PeriodDtype', 'PeriodIndex', 'RangeIndex', 'Series', 'SparseDtype', 'StringDtype', 'Timedelta', 'TimedeltaIndex', 'Timestamp', 'UInt16Dtype', 'UInt32Dtype', 'UInt64Dtype', 'UInt64Index', 'UInt8Dtype', '__builtins__', '__cached__', '__doc__', '__docformat__', '__file__', '__getattr__', '__git_version__', '__loader__', '__name__', '__package__', '__path__', '__spec__', '__version__', '_config', '_hashtable', '_is_numpy_dev', '_lib', '_libs', '_np_version_under1p17', '_np_version_under1p18', '_testing', '_tslib', '_typing', '_version', 'api', 'array', 'arrays', 'bdate_range', 'compat', 'concat', 'core', 'crosstab', 'cut', 'date_range', 'describe_option', 'errors', 'eval', 'factorize', 'get_dummies', 'get_option', 'infer_freq', 'interval_range', 'io', 'isna', 'isnull', 'json_normalize', 'lreshape', 'melt', 'merge', 'merge_asof', 'merge_ordered', 'notna', 'notnull', 'offsets', 'option_context', 'options', 'pandas', 'period_range', 'pivot', 'pivot_table', 'plotting', 'qcut', 'read_clipboard', 'read_csv', 'read_excel', 'read_feather', 'read_fwf', 'read_gbq', 'read_hdf', 'read_html', 'read_json', 'read_orc', 'read_parquet', 'read_pickle', 'read_sas', 'read_spss', 'read_sql', 'read_sql_query', 'read_sql_table', 'read_stata', 'read_table', 'reset_option', 'set_eng_float_format', 'set_option', 'show_versions', 'test', 'testing', 'timedelta_range', 'to_datetime', 'to_numeric', 'to_pickle', 'to_timedelta', 'tseries', 'unique', 'util', 'value_counts', 'wide_to_long']